In [53]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib
from matplotlib import colormaps
import datetime as dt
from datetime import datetime

In [54]:
study_pfm=pd.read_csv("/Users/roaa/Downloads/study_performance.csv")

In [55]:
study_pfm.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [56]:
study_pfm.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race_ethnicity               1000 non-null   object
 2   parental_level_of_education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test_preparation_course      1000 non-null   object
 5   math_score                   1000 non-null   int64
 6   reading_score                1000 non-null   int64
 7   writing_score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [57]:
study_pfm.isnull().sum()

gender                         0
race_ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
dtype: int64

In [58]:
study_pfm.describe()

       math_score  reading_score  writing_score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [59]:
(study_pfm['math_score']==0).sum()

1

In [60]:
study_pfm.loc[(study_pfm['math_score']==0)]

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
59,female,group C,some high school,free/reduced,none,0,17,10

In [61]:
study_pfm['math_score']=study_pfm['math_score'].replace(0,np.nan)

In [62]:
study_pfm.dropna(subset=['math_score'],inplace=True)

In [63]:
study_pfm.describe()

       math_score  reading_score  writing_score
count  999.000000     999.000000     999.000000
mean    66.155155      69.221221      68.112112
std     15.025594      14.513766      15.091685
min      8.000000      23.000000      15.000000
25%     57.000000      59.000000      58.000000
50%     66.000000      70.000000      69.000000
75%     77.000000      79.000000      79.000000
max    100.000000     100.000000     100.000000

In [64]:
study_pfm.sample(5)

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
348,male,group D,high school,free/reduced,none,75.0,74,66
102,female,group D,associate's degree,standard,none,85.0,91,89
792,male,group D,high school,free/reduced,none,66.0,74,69
476,male,group E,bachelor's degree,standard,completed,76.0,62,66
116,female,group B,bachelor's degree,free/reduced,none,75.0,85,82

In [65]:
study_pfm['total']=(study_pfm['math_score']+study_pfm['reading_score']+study_pfm['writing_score'])

In [66]:
study_pfm['total%']=((study_pfm['math_score']+study_pfm['reading_score']+study_pfm['writing_score'])/300)*100

In [67]:
study_pfm['total%']=study_pfm['total%'].astype(int)

In [68]:
study_pfm.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,total,total%
0,female,group B,bachelor's degree,standard,none,72.0,72,74,218.0,72
1,female,group C,some college,standard,completed,69.0,90,88,247.0,82
2,female,group B,master's degree,standard,none,90.0,95,93,278.0,92
3,male,group A,associate's degree,free/reduced,none,47.0,57,44,148.0,49
4,male,group C,some college,standard,none,76.0,78,75,229.0,76

In [69]:
study_pfm['gender'].value_counts()

gender
female    517
male      482
Name: count, dtype: int64

In [70]:
study_pfm['race_ethnicity'].value_counts()

race_ethnicity
group C    318
group D    262
group B    190
group E    140
group A     89
Name: count, dtype: int64

In [71]:
study_pfm['parental_level_of_education'].value_counts()

parental_level_of_education
some college          226
associate's degree    222
high school           196
some high school      178
bachelor's degree     118
master's degree        59
Name: count, dtype: int64

In [72]:
study_pfm['lunch'].value_counts()

lunch
standard        645
free/reduced    354
Name: count, dtype: int64

In [73]:
study_pfm['test_preparation_course'].value_counts()

test_preparation_course
none         641
completed    358
Name: count, dtype: int64

In [74]:
a=pd.DataFrame(study_pfm.groupby('gender')['total%'].aggregate(np.mean))
a

           total%
gender
female  69.353965
male    65.506224

In [75]:
b=study_pfm.pivot_table(index='gender',columns='parental_level_of_education',values='total%',aggfunc=('mean'))
b.round(2)

parental_level_of_education,associate's degree,bachelor's degree,high school,master's degree,some college,some high school
gender,,,,,,
female,70.79,74.32,64.40,73.28,70.66,65.91
male,67.52,68.49,61.22,73.26,65.41,64.28

In [76]:
c=study_pfm.pivot_table(index='gender',columns='test_preparation_course',values='total%',aggfunc=('mean'))
c.round()

test_preparation_course  completed  none
gender
female                        74.0  67.0
male                          70.0  63.0

In [77]:
d=study_pfm.pivot_table(index='gender',columns='race_ethnicity',values='total%',aggfunc=('max'))
d.round()

race_ethnicity  group A  group B  group C  group D  group E
gender
female               96       96       98       99      100
male                 94       92       94       98      100

In [78]:
study_pfm.loc[study_pfm['total%']>=80].value_counts()

gender  race_ethnicity  parental_level_of_education  lunch         test_preparation_course  math_score  reading_score  writing_score  total  total%
female  group A         associate's degree           standard      none                     82.0        93             93             268.0  89        1
male    group B         associate's degree           standard      completed                81.0        82             82             245.0  81        1
                                                                                            91.0        89             92             272.0  90        1
                                                                   none                     87.0        85             73             245.0  81        1
                                                                                            90.0        78             81             249.0  83        1
                                                                                                                                                      ..
female  group D         bachelor's degree            free/reduced  none                     78.0        90             93             261.0  87        1
                                                     standard      none                     79.0        89             89             257.0  85        1
                                                                                            89.0        100            100            289.0  96        1
                        high school                  free/reduced  none                     73.0        92             84             249.0  83        1
male    group E         some high school             standard      none                     94.0        88             78             260.0  86        1
Name: count, Length: 198, dtype: int64

In [ ]:
#there is 198 stedents they have total more than 80

In [26]:
a.to_excel("a.xlsx",index=False)

In [27]:
b.to_excel("b.xlsx",index=False)

In [28]:
c.to_excel("c.xlsx",index=False)

In [29]:
d.to_excel("d.xlsx",index=False)

In [ ]:
study_pfm.to_excel("spn.xlsx",index=False)